{ "url" : "peter", "name" : "Peter Griffin", "bio" : "Peter L&ouml;wenbr&auml;u Griffin is a fictional character of the animated comedy series Family Guy and the patriarch of the Griffin family. He is voiced by cartoonist Seth MacFarlane and first appeared on television, along with the rest of the family in the 15-minute short on December 20, 1998. Peter was created and designed by MacFarlane himself. MacFarlane was asked to pitch a pilot to the Fox Broadcasting Company based on Larry and Steve, a short made by MacFarlane which featured a middle-aged character named Larry and an intellectual dog, Steve. After the pilot was given the green light, The Griffin family appeared on the episode \"Death Has a Shadow\".", "image" : "/images/peter.png", "_id" : { "$oid" : "4eb82635940cda0000000001" } }
{ "url" : "adam", "name" : "Adam West", "bio" : "Adam West (born September 19, 1928) is an American actor best known for his lead role in the 1960s TV series Batman and the film of the same name. He is currently known for portraying eccentric characters, as well as his voice work on animated series such as <em>The Fairly OddParents</em> and as the fictionalized version of himself on <em>Family Guy</em>.", "image" : "/images/adam.png", "_id" : { "$oid" : "4eb82635940cda0000000002" } }
{ "url" : "brian", "name" : "Brian Griffin", "bio" : "Brian Griffin is a fictional character and is one of the protagonists of the animated comedy series Family Guy and the pet of the Griffin family. He is voiced by cartoonist Seth MacFarlane and first appeared on television, along with the rest of the family, in the 15-minute short on December 20, 1998. Brian was created and designed by MacFarlane himself. MacFarlane was asked to pitch a pilot to the Fox Broadcasting Company based on Larry and Steve, a short made by MacFarlane which featured a middle-aged character named Larry and an intellectual dog, Steve. After the pilot was given the green light, the Griffin family appeared on the episode \"Death Has a Shadow\".", "image" : "/images/brian.png", "_id" : { "$oid" : "4eb82635940cda0000000003" } }
{ "url" : "glen", "name" : "Glen Quagmire", "bio" : "Glenn Quagmire, often referred to as just Quagmire, is a fictional character on the animated series Family Guy, best known for his hypersexuality. Creator and voice actor Seth MacFarlane describes Quagmire as \"an appalling human being who is still caught in the rat-pack era\" based on anachronistic 1950s party-animal clichés. His neighbor and friend Peter Griffin describes him as a \"heartless sex hound\" and refers to him as \"a rapist\" in The Cleveland Show. By profession, Quagmire is an airline pilot.", "image" : "/images/quagmire.png", "_id" : { "$oid" : "4eb82635940cda0000000004" } }
{ "url" : "stewie", "name" : "Stewie Griffin", "bio" : "Stewart Gilligan \"Stewie\" Griffin is a main character of the animated series Family Guy voiced by Seth MacFarlane. Once obsessed with world domination and matricide, Stewie is the youngest child of Peter and Lois Griffin. His older siblings are Chris and Meg. Stewie is considered to be the show's breakout character. Wizard magazine rated him the 95th greatest villain of all time.", "image" : "/images/stewie.png", "_id" : { "$oid" : "4eb82635940cda0000000005" } }
